#### Terraform format and style: `success`
#### Terraform initialization: `success`
#### Terraform validation: `success`

<details><summary>Show validation output</summary>

```

$ terraform validate
Success! The configuration is valid.


```

</details>

#### Terraform plan: `success`

<details><summary>Show plan</summary>

```

$ terraform plan
module.sks.exoscale_sks_cluster.this: Refreshing state... [id=83bbd0b1-435b-4c33-8226-95573e4133ab]
data.exoscale_domain.domain: Reading...
module.cert-manager.module.cert-manager.data.utils_deep_merge_yaml.values: Reading...
module.cert-manager.module.cert-manager.data.utils_deep_merge_yaml.values: Read complete after 0s [id=92a1128bf87103aeca8544379828362a7c34dee5]
module.oidc.data.aws_region.current: Reading...
module.oidc.data.aws_region.current: Read complete after 0s [id=eu-west-1]
data.exoscale_domain.domain: Read complete after 1s [id=89083a5c-b648-474a-0000-00000010c5c5]
module.sks.data.exoscale_domain.this[0]: Reading...
module.sks.data.exoscale_domain.this[0]: Read complete after 0s [id=89083a5c-b648-474a-0000-00000010c5c5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # argocd_application.llm-apps will be created
  + resource "argocd_application" "llm-apps" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = false

      + metadata {
          + generation       = (known after apply)
          + name             = "llm-apps"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-apps"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "argocd"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "llm-apps"
              + repo_url        = "https://github.com/camptocamp/self-hosted-llm-models-tests.git"
              + target_revision = "main"

              + helm {
                  + value_files = [
                      + "values.yaml",
                    ]
                  + values      = <<-EOT
                        "workEnvironments":
                          "bquartier":
                            "apps": {}
                            "name": "Benoît Quartier"
                          "chornberger":
                            "apps":
                              "auto_sync": true
                              "list":
                              - "chart_repo_url": "https://github.com/camptocamp/self-hosted-llm-models-charts.git"
                                "name": "llama-cpp"
                                "target_revision": "chr-patch-1"
                                "values_repo_url": "https://github.com/chornberger-c2c/self-hosted-llm-models-values.git"
                            "name": "Christopher Hornberger"
                          "gheleno":
                            "apps": {}
                            "name": "Gonçalo Heleno"
                    EOT
                }
            }

          + sync_policy {
              + automated {
                  + allow_empty = true
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

  # argocd_project.llm-apps will be created
  + resource "argocd_project" "llm-apps" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "llm-apps"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + description  = "LLM applications and their dependencies (e.g. NVIDIA Device Plugin)"
          + source_repos = [
              + "https://github.com/camptocamp/self-hosted-llm-models-tests.git",
              + "https://github.com/camptocamp/self-hosted-llm-models-charts.git",
            ]

          + cluster_resource_whitelist {
              + group = "*"
              + kind  = "*"
            }

          + destination {
                name      = null
              + namespace = "*"
              + server    = "https://kubernetes.default.svc"
            }
          + destination {
              + name      = "in-cluster"
              + namespace = "*"
                # (1 unchanged attribute hidden)
            }

          + namespace_resource_whitelist {
              + group = "*"
              + kind  = "*"
            }

          + orphaned_resources {
              + warn = true

              + ignore {
                  + kind  = "Secret"
                  + name  = "*"
                    # (1 unchanged attribute hidden)
                }
              + ignore {
                  + group = "argoproj.io"
                  + kind  = "*"
                  + name  = "*"
                }
            }
        }
    }

  # aws_s3_bucket.this["loki"] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "llm-models-sks-loki"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.this["longhorn"] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "llm-models-sks-longhorn"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.this["thanos"] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "llm-models-sks-thanos"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # exoscale_iam_api_key.s3_iam_api_key["loki"] will be created
  + resource "exoscale_iam_api_key" "s3_iam_api_key" {
      + id      = (known after apply)
      + key     = (known after apply)
      + name    = "llm-models-sks-loki-s3-iam-key"
      + role_id = (known after apply)
      + secret  = (sensitive value)
    }

  # exoscale_iam_api_key.s3_iam_api_key["longhorn"] will be created
  + resource "exoscale_iam_api_key" "s3_iam_api_key" {
      + id      = (known after apply)
      + key     = (known after apply)
      + name    = "llm-models-sks-longhorn-s3-iam-key"
      + role_id = (known after apply)
      + secret  = (sensitive value)
    }

  # exoscale_iam_api_key.s3_iam_api_key["thanos"] will be created
  + resource "exoscale_iam_api_key" "s3_iam_api_key" {
      + id      = (known after apply)
      + key     = (known after apply)
      + name    = "llm-models-sks-thanos-s3-iam-key"
      + role_id = (known after apply)
      + secret  = (sensitive value)
    }

  # exoscale_iam_role.s3_role["loki"] will be created
  + resource "exoscale_iam_role" "s3_role" {
      + description = "Role for SOS bucket loki for the llm-models-sks SKS cluster. Created using Terraform."
      + editable    = true
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "llm-models-sks-loki-s3-role"
      + permissions = (known after apply)
      + policy      = {
          + default_service_strategy = "deny"
          + services                 = {
              + "sos" = {
                  + rules = [
                      + {
                          + action     = "allow"
                          + expression = "!(operation in ['create-bucket', 'delete-bucket'])"
                        },
                      + {
                          + action     = "deny"
                          + expression = "!(parameters.bucket in ['loki'])"
                        },
                    ]
                  + type  = "rules"
                },
            }
        }
    }

  # exoscale_iam_role.s3_role["longhorn"] will be created
  + resource "exoscale_iam_role" "s3_role" {
      + description = "Role for SOS bucket longhorn for the llm-models-sks SKS cluster. Created using Terraform."
      + editable    = true
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "llm-models-sks-longhorn-s3-role"
      + permissions = (known after apply)
      + policy      = {
          + default_service_strategy = "deny"
          + services                 = {
              + "sos" = {
                  + rules = [
                      + {
                          + action     = "allow"
                          + expression = "!(operation in ['create-bucket', 'delete-bucket'])"
                        },
                      + {
                          + action     = "deny"
                          + expression = "!(parameters.bucket in ['longhorn'])"
                        },
                    ]
                  + type  = "rules"
                },
            }
        }
    }

  # exoscale_iam_role.s3_role["thanos"] will be created
  + resource "exoscale_iam_role" "s3_role" {
      + description = "Role for SOS bucket thanos for the llm-models-sks SKS cluster. Created using Terraform."
      + editable    = true
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "llm-models-sks-thanos-s3-role"
      + permissions = (known after apply)
      + policy      = {
          + default_service_strategy = "deny"
          + services                 = {
              + "sos" = {
                  + rules = [
                      + {
                          + action     = "allow"
                          + expression = "!(operation in ['create-bucket', 'delete-bucket'])"
                        },
                      + {
                          + action     = "deny"
                          + expression = "!(parameters.bucket in ['thanos'])"
                        },
                    ]
                  + type  = "rules"
                },
            }
        }
    }

  # null_resource.llm-apps will be created
  + resource "null_resource" "llm-apps" {
      + id       = (known after apply)
      + triggers = {
          + "argocd" = (known after apply)
        }
    }

  # module.argocd.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + append_list = true
      + id          = (known after apply)
      + input       = [
          + (known after apply),
        ]
      + output      = (known after apply)
    }

  # module.argocd.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = false
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "argocd"
              + "cluster"     = "in-cluster"
            }
          + name             = "argocd"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "argocd"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/argocd"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-argocd.git"
              + target_revision = "v5.2.0"

              + helm {
                  + release_name = "argocd"
                  + values       = (known after apply)
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }
    }

  # module.argocd.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd"                = (known after apply)
          + "cert-manager"          = (known after apply)
          + "kube-prometheus-stack" = (known after apply)
          + "oidc"                  = (known after apply)
          + "traefik"               = (known after apply)
        }
    }

  # module.argocd.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.argocd_bootstrap.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + append_list = true
      + id          = (known after apply)
      + input       = [
          + (known after apply),
          + jsonencode({}),
        ]
      + output      = (known after apply)
    }

  # module.argocd_bootstrap.argocd_project.devops_stack_applications["llm-models-sks"] will be created
  + resource "argocd_project" "devops_stack_applications" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "llm-models-sks"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + description  = "DevOps Stack applications in cluster in-cluster"
          + source_repos = [
              + "*",
            ]

          + cluster_resource_whitelist {
              + group = "*"
              + kind  = "*"
            }

          + destination {
              + name      = "in-cluster"
              + namespace = "*"
                # (1 unchanged attribute hidden)
            }

          + orphaned_resources {
              + warn = true
            }
        }
    }

  # module.argocd_bootstrap.helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = true
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 10800
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "7.1.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argocd_bootstrap.jwt_hashed_token.argocd will be created
  + resource "jwt_hashed_token" "argocd" {
      + algorithm   = "HS256"
      + claims_json = (known after apply)
      + id          = (known after apply)
      + secret      = (sensitive value)
      + token       = (sensitive value)
    }

  # module.argocd_bootstrap.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.argocd_bootstrap.random_password.argocd_server_secretkey will be created
  + resource "random_password" "argocd_server_secretkey" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.argocd_bootstrap.random_uuid.jti will be created
  + resource "random_uuid" "jti" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.argocd_bootstrap.time_static.iat will be created
  + resource "time_static" "iat" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.longhorn.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + (sensitive value),
        ]
      + output = (known after apply)
    }

  # module.longhorn.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "longhorn"
              + "cluster"     = "in-cluster"
            }
          + name             = "longhorn"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "longhorn-system"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/longhorn"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-longhorn.git"
              + target_revision = "v3.6.0"

              + helm {
                  + release_name = "longhorn"
                  + values       = (known after apply)
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
        }
    }

  # module.longhorn.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd"       = (known after apply)
          + "cert-manager" = (known after apply)
          + "oidc"         = (known after apply)
          + "traefik"      = (known after apply)
        }
    }

  # module.longhorn.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.longhorn.random_string.oauth2_cookie_secret will be created
  + resource "random_string" "oauth2_cookie_secret" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.oidc.aws_cognito_user.devops_stack_users["bquartier"] will be created
  + resource "aws_cognito_user" "devops_stack_users" {
      + attributes               = {
          + "email"          = "benoit.quartier@camptocamp.com"
          + "email_verified" = "true"
          + "family_name"    = "Quartier"
          + "given_name"     = "Benoît"
        }
      + creation_date            = (known after apply)
      + desired_delivery_mediums = [
          + "EMAIL",
        ]
      + enabled                  = true
      + id                       = (known after apply)
      + last_modified_date       = (known after apply)
      + mfa_setting_list         = (known after apply)
      + preferred_mfa_setting    = (known after apply)
      + status                   = (known after apply)
      + sub                      = (known after apply)
      + user_pool_id             = (known after apply)
      + username                 = "bquartier"
    }

  # module.oidc.aws_cognito_user.devops_stack_users["chornberger"] will be created
  + resource "aws_cognito_user" "devops_stack_users" {
      + attributes               = {
          + "email"          = "christopher.hornberger@camptocamp.com"
          + "email_verified" = "true"
          + "family_name"    = "Hornberger"
          + "given_name"     = "Christopher"
        }
      + creation_date            = (known after apply)
      + desired_delivery_mediums = [
          + "EMAIL",
        ]
      + enabled                  = true
      + id                       = (known after apply)
      + last_modified_date       = (known after apply)
      + mfa_setting_list         = (known after apply)
      + preferred_mfa_setting    = (known after apply)
      + status                   = (known after apply)
      + sub                      = (known after apply)
      + user_pool_id             = (known after apply)
      + username                 = "chornberger"
    }

  # module.oidc.aws_cognito_user.devops_stack_users["gheleno"] will be created
  + resource "aws_cognito_user" "devops_stack_users" {
      + attributes               = {
          + "email"          = "goncalo.heleno@camptocamp.com"
          + "email_verified" = "true"
          + "family_name"    = "Heleno"
          + "given_name"     = "Gonçalo"
        }
      + creation_date            = (known after apply)
      + desired_delivery_mediums = [
          + "EMAIL",
        ]
      + enabled                  = true
      + id                       = (known after apply)
      + last_modified_date       = (known after apply)
      + mfa_setting_list         = (known after apply)
      + preferred_mfa_setting    = (known after apply)
      + status                   = (known after apply)
      + sub                      = (known after apply)
      + user_pool_id             = (known after apply)
      + username                 = "gheleno"
    }

  # module.oidc.aws_cognito_user_group.devops_stack_admin_group will be created
  + resource "aws_cognito_user_group" "devops_stack_admin_group" {
      + description  = "Users with administrator access to the applications on the cluster llm-models-sks."
      + id           = (known after apply)
      + name         = "devops-stack-admins"
      + user_pool_id = (known after apply)
    }

  # module.oidc.aws_cognito_user_in_group.devops_stack_users["bquartier"] will be created
  + resource "aws_cognito_user_in_group" "devops_stack_users" {
      + group_name   = "devops-stack-admins"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "bquartier"
    }

  # module.oidc.aws_cognito_user_in_group.devops_stack_users["chornberger"] will be created
  + resource "aws_cognito_user_in_group" "devops_stack_users" {
      + group_name   = "devops-stack-admins"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "chornberger"
    }

  # module.oidc.aws_cognito_user_in_group.devops_stack_users["gheleno"] will be created
  + resource "aws_cognito_user_in_group" "devops_stack_users" {
      + group_name   = "devops-stack-admins"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "gheleno"
    }

  # module.oidc.aws_cognito_user_pool.devops_stack_user_pool[0] will be created
  + resource "aws_cognito_user_pool" "devops_stack_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "llm-models-sks-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + password_policy (known after apply)

      + sms_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.oidc.aws_cognito_user_pool_client.client will be created
  + resource "aws_cognito_user_pool_client" "client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "https://alertmanager.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://alertmanager.llm-models-sks.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://argocd.is-sandbox-exo.camptocamp.com/auth/callback",
          + "https://argocd.llm-models-sks.is-sandbox-exo.camptocamp.com/auth/callback",
          + "https://grafana.is-sandbox-exo.camptocamp.com/login/generic_oauth",
          + "https://grafana.llm-models-sks.is-sandbox-exo.camptocamp.com/login/generic_oauth",
          + "https://longhorn.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://longhorn.llm-models-sks.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://prometheus.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://prometheus.llm-models-sks.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://thanos-bucketweb.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://thanos-bucketweb.llm-models-sks.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://thanos-query.is-sandbox-exo.camptocamp.com/oauth2/callback",
          + "https://thanos-query.llm-models-sks.is-sandbox-exo.camptocamp.com/oauth2/callback",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = (known after apply)
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "client-llm-models-sks"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.oidc.aws_cognito_user_pool_domain.devops_stack_user_pool_domain[0] will be created
  + resource "aws_cognito_user_pool_domain" "devops_stack_user_pool_domain" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "llm-models-sks"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # module.oidc.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {}
    }

  # module.oidc.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.sks.exoscale_anti_affinity_group.this["llm-models-sks-default"] will be created
  + resource "exoscale_anti_affinity_group" "this" {
      + description = "Anti-affinity group to prevent the llm-models-sks-default cluster nodes running on the same physical host."
      + id          = (known after apply)
      + name        = "nodepool-llm-models-sks-default"
    }

  # module.sks.exoscale_anti_affinity_group.this["llm-models-sks-llm"] will be created
  + resource "exoscale_anti_affinity_group" "this" {
      + description = "Anti-affinity group to prevent the llm-models-sks-llm cluster nodes running on the same physical host."
      + id          = (known after apply)
      + name        = "nodepool-llm-models-sks-llm"
    }

  # module.sks.exoscale_anti_affinity_group.this["llm-models-sks-router"] will be created
  + resource "exoscale_anti_affinity_group" "this" {
      + description = "Anti-affinity group to prevent the llm-models-sks-router cluster nodes running on the same physical host."
      + id          = (known after apply)
      + name        = "nodepool-llm-models-sks-router"
    }

  # module.sks.exoscale_domain_record.wildcard_with_cluster_name[0] will be created
  + resource "exoscale_domain_record" "wildcard_with_cluster_name" {
      + content            = (known after apply)
      + content_normalized = (known after apply)
      + domain             = "89083a5c-b648-474a-0000-00000010c5c5"
      + hostname           = (known after apply)
      + id                 = (known after apply)
      + name               = "*.llm-models-sks"
      + prio               = (known after apply)
      + record_type        = "A"
      + ttl                = 300
    }

  # module.sks.exoscale_nlb.this will be created
  + resource "exoscale_nlb" "this" {
      + created_at = (known after apply)
      + id         = (known after apply)
      + ip_address = (known after apply)
      + name       = "ingress-llm-models-sks"
      + services   = (known after apply)
      + state      = (known after apply)
      + zone       = "de-fra-1"
    }

  # module.sks.exoscale_security_group.this will be created
  + resource "exoscale_security_group" "this" {
      + description = "Security group for the llm-models-sks cluster nodes."
      + id          = (known after apply)
      + name        = "nodepool-llm-models-sks"
    }

  # module.sks.exoscale_security_group_rule.all will be created
  + resource "exoscale_security_group_rule" "all" {
      + description            = "Allow all traffic from the security group itself."
      + end_port               = 65535
      + id                     = (known after apply)
      + protocol               = "TCP"
      + public_security_group  = (known after apply)
      + security_group         = (known after apply)
      + security_group_id      = (known after apply)
      + start_port             = 1
      + type                   = "INGRESS"
      + user_security_group    = (known after apply)
      + user_security_group_id = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.cilium_health_check[0] will be created
  + resource "exoscale_security_group_rule" "cilium_health_check" {
      + description            = "Allow Calico health checks between worker nodes."
      + end_port               = 4240
      + id                     = (known after apply)
      + protocol               = "TCP"
      + public_security_group  = (known after apply)
      + security_group         = (known after apply)
      + security_group_id      = (known after apply)
      + start_port             = 4240
      + type                   = "INGRESS"
      + user_security_group    = (known after apply)
      + user_security_group_id = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.cilium_health_check_icmp[0] will be created
  + resource "exoscale_security_group_rule" "cilium_health_check_icmp" {
      + description            = "Allow Calico health checks ICMP between worker nodes."
      + icmp_code              = 0
      + icmp_type              = 8
      + id                     = (known after apply)
      + protocol               = "ICMP"
      + public_security_group  = (known after apply)
      + security_group         = (known after apply)
      + security_group_id      = (known after apply)
      + type                   = "INGRESS"
      + user_security_group    = (known after apply)
      + user_security_group_id = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.cilium_traffic[0] will be created
  + resource "exoscale_security_group_rule" "cilium_traffic" {
      + description            = "Allow Cilium VXLAN communication between worker nodes."
      + end_port               = 8472
      + id                     = (known after apply)
      + protocol               = "UDP"
      + public_security_group  = (known after apply)
      + security_group         = (known after apply)
      + security_group_id      = (known after apply)
      + start_port             = 8472
      + type                   = "INGRESS"
      + user_security_group    = (known after apply)
      + user_security_group_id = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.http will be created
  + resource "exoscale_security_group_rule" "http" {
      + cidr                  = "0.0.0.0/0"
      + description           = "Allow incoming HTTP traffic from the outside world."
      + end_port              = 80
      + id                    = (known after apply)
      + protocol              = "TCP"
      + public_security_group = (known after apply)
      + security_group        = (known after apply)
      + security_group_id     = (known after apply)
      + start_port            = 80
      + type                  = "INGRESS"
      + user_security_group   = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.https will be created
  + resource "exoscale_security_group_rule" "https" {
      + cidr                  = "0.0.0.0/0"
      + description           = "Allow incoming HTTP traffic from the outside world."
      + end_port              = 443
      + id                    = (known after apply)
      + protocol              = "TCP"
      + public_security_group = (known after apply)
      + security_group        = (known after apply)
      + security_group_id     = (known after apply)
      + start_port            = 443
      + type                  = "INGRESS"
      + user_security_group   = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.nodeport_tcp_services[0] will be created
  + resource "exoscale_security_group_rule" "nodeport_tcp_services" {
      + cidr                  = "0.0.0.0/0"
      + description           = "NodePort TCP services"
      + end_port              = 32767
      + id                    = (known after apply)
      + protocol              = "TCP"
      + public_security_group = (known after apply)
      + security_group        = (known after apply)
      + security_group_id     = (known after apply)
      + start_port            = 30000
      + type                  = "INGRESS"
      + user_security_group   = (known after apply)
    }

  # module.sks.exoscale_security_group_rule.sks_logs will be created
  + resource "exoscale_security_group_rule" "sks_logs" {
      + cidr                  = "0.0.0.0/0"
      + description           = "Allow kubelet traffic between worker nodes."
      + end_port              = 10250
      + id                    = (known after apply)
      + protocol              = "TCP"
      + public_security_group = (known after apply)
      + security_group        = (known after apply)
      + security_group_id     = (known after apply)
      + start_port            = 10250
      + type                  = "INGRESS"
      + user_security_group   = (known after apply)
    }

  # module.sks.exoscale_sks_kubeconfig.this will be created
  + resource "exoscale_sks_kubeconfig" "this" {
      + cluster_id            = "83bbd0b1-435b-4c33-8226-95573e4133ab"
      + early_renewal_seconds = 0
      + groups                = [
          + "system:masters",
        ]
      + id                    = (known after apply)
      + kubeconfig            = (sensitive value)
      + ready_for_renewal     = true
      + ttl_seconds           = 0
      + user                  = "kubernetes-admin"
      + zone                  = "de-fra-1"
    }

  # module.sks.exoscale_sks_nodepool.this["llm-models-sks-default"] will be created
  + resource "exoscale_sks_nodepool" "this" {
      + anti_affinity_group_ids = (known after apply)
      + cluster_id              = "83bbd0b1-435b-4c33-8226-95573e4133ab"
      + created_at              = (known after apply)
      + description             = "Default node pool for llm-models-sks."
      + disk_size               = 400
      + id                      = (known after apply)
      + instance_pool_id        = (known after apply)
      + instance_prefix         = "default"
      + instance_type           = "standard.large"
      + name                    = "llm-models-sks-default"
      + security_group_ids      = (known after apply)
      + size                    = 3
      + state                   = (known after apply)
      + storage_lvm             = false
      + template_id             = (known after apply)
      + version                 = (known after apply)
      + zone                    = "de-fra-1"
    }

  # module.sks.exoscale_sks_nodepool.this["llm-models-sks-llm"] will be created
  + resource "exoscale_sks_nodepool" "this" {
      + anti_affinity_group_ids = (known after apply)
      + cluster_id              = "83bbd0b1-435b-4c33-8226-95573e4133ab"
      + created_at              = (known after apply)
      + description             = "GPU3 node pool for llm-models-sks for LLM deployment."
      + disk_size               = 400
      + id                      = (known after apply)
      + instance_pool_id        = (known after apply)
      + instance_prefix         = "llm"
      + instance_type           = "gpu3.small"
      + labels                  = {
          + "role" = "llm"
        }
      + name                    = "llm-models-sks-llm"
      + security_group_ids      = (known after apply)
      + size                    = 1
      + state                   = (known after apply)
      + storage_lvm             = false
      + taints                  = {
          + "nodepool" = "llm:NoSchedule"
        }
      + template_id             = (known after apply)
      + version                 = (known after apply)
      + zone                    = "de-fra-1"
    }

  # module.sks.exoscale_sks_nodepool.this["llm-models-sks-router"] will be created
  + resource "exoscale_sks_nodepool" "this" {
      + anti_affinity_group_ids = (known after apply)
      + cluster_id              = "83bbd0b1-435b-4c33-8226-95573e4133ab"
      + created_at              = (known after apply)
      + description             = "Router node pool for llm-models-sks used to avoid loopbacks."
      + disk_size               = 20
      + id                      = (known after apply)
      + instance_pool_id        = (known after apply)
      + instance_prefix         = "router"
      + instance_type           = "standard.small"
      + name                    = "llm-models-sks-router"
      + security_group_ids      = (known after apply)
      + size                    = 2
      + state                   = (known after apply)
      + storage_lvm             = false
      + taints                  = {
          + "nodepool" = "router:NoSchedule"
        }
      + template_id             = (known after apply)
      + version                 = (known after apply)
      + zone                    = "de-fra-1"
    }

  # module.cert-manager.module.cert-manager.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "cert-manager"
              + "cluster"     = "in-cluster"
            }
          + name             = "cert-manager"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "cert-manager"
                # (1 unchanged attribute hidden)
            }

          + ignore_difference {
              + group         = "admissionregistration.k8s.io"
              + json_pointers = [
                  + "/webhooks/0/namespaceSelector/matchExpressions",
                ]
              + kind          = "ValidatingWebhookConfiguration"
              + name          = "cert-manager-webhook"
            }

          + source {
              + path            = "charts/cert-manager"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-cert-manager.git"
              + target_revision = "v8.3.0"

              + helm {
                  + release_name = "cert-manager"
                  + values       = <<-EOT
                        cert-manager:
                          cainjector:
                            resources:
                              limits:
                                memory: 128Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          clusterIssuers:
                            acme:
                              solvers:
                              - http01:
                                  ingress: {}
                            letsencrypt:
                              enabled: true
                          installCRDs: true
                          prometheus:
                            servicemonitor:
                              enabled: false
                          resources:
                            limits:
                              memory: 128Mi
                            requests:
                              cpu: 50m
                              memory: 128Mi
                          securityContext:
                            fsGroup: 999
                          startupapicheck:
                            resources:
                              limits:
                                memory: 128Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          webhook:
                            resources:
                              limits:
                                memory: 128Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                        issuers:
                          ca:
                            name: ca-issuer
                          default:
                            name: selfsigned-issuer
                          letsencrypt:
                            letsencrypt-prod:
                              email: letsencrypt@camptocamp.com
                              server: https://acme-v02.api.letsencrypt.org/directory
                            letsencrypt-staging:
                              email: letsencrypt@camptocamp.com
                              server: https://acme-staging-v02.api.letsencrypt.org/directory
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }
    }

  # module.cert-manager.module.cert-manager.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd" = (known after apply)
        }
    }

  # module.cert-manager.module.cert-manager.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + append_list = false
      + id          = (known after apply)
      + input       = [
          + (known after apply),
        ]
      + output      = (known after apply)
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "kube-prometheus-stack"
              + "cluster"     = "in-cluster"
            }
          + name             = "kube-prometheus-stack"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "kube-prometheus-stack"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/kube-prometheus-stack"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-kube-prometheus-stack.git"
              + target_revision = "v11.1.1"

              + plugin {
                  + name = "kustomized-helm"

                  + env {
                      + name  = "HELM_ARGS"
                      + value = "--name-template kube-prometheus-stack"
                    }
                  + env {
                      + name  = "HELM_VALUES"
                      + value = (known after apply)
                    }
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=false",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
        }
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.kubernetes_namespace.kube_prometheus_stack_namespace will be created
  + resource "kubernetes_namespace" "kube_prometheus_stack_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "kube-prometheus-stack"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.kubernetes_secret.thanos_object_storage_secret[0] will be created
  + resource "kubernetes_secret" "thanos_object_storage_secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "thanos-objectstorage"
          + namespace        = "kube-prometheus-stack"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd"       = (known after apply)
          + "cert-manager" = (known after apply)
          + "loki-stack"   = (known after apply)
          + "longhorn"     = (known after apply)
          + "oidc"         = (known after apply)
          + "traefik"      = (known after apply)
        }
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.random_password.grafana_admin_password will be created
  + resource "random_password" "grafana_admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.kube-prometheus-stack.module.kube-prometheus-stack.random_password.oauth2_cookie_secret will be created
  + resource "random_password" "oauth2_cookie_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.loki-stack.module.loki-stack.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + <<-EOT
                "datasourceURL": "http://loki-query-frontend.loki-stack:3100"
                "eventHandler":
                  "affinity": {}
                  "grafanaAgentTag": "main-4f86002"
                  "labels": {}
                  "lokiURL": "http://loki-distributor.loki-stack:3100/loki/api/v1/push"
                  "namespace": "loki-stack"
                "frontendIngress": null
                "loki-distributed":
                  "compactor":
                    "enabled": true
                    "persistence":
                      "enabled": true
                    "resources":
                      "limits":
                        "memory": "1Gi"
                      "requests":
                        "cpu": "100m"
                        "memory": "512Mi"
                  "distributor":
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "fullnameOverride": "loki"
                  "gateway":
                    "enabled": false
                  "indexGateway":
                    "enabled": true
                    "persistence":
                      "enabled": true
                    "resources":
                      "limits":
                        "memory": "1Gi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "ingester":
                    "affinity": ""
                    "maxUnavailable": 1
                    "persistence":
                      "enabled": true
                    "replicas": 3
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "loki":
                    "structuredConfig":
                      "chunk_store_config":
                        "chunk_cache_config":
                          "memcached":
                            "expiration": "24h"
                          "memcached_client":
                            "service": "memcached-client"
                            "timeout": "500ms"
                      "common":
                        "compactor_address": "http://loki-compactor:3100"
                      "compactor":
                        "retention_enabled": true
                      "ingester":
                        "lifecycler":
                          "ring":
                            "replication_factor": 3
                        "wal":
                          "flush_on_shutdown": true
                          "replay_memory_ceiling": "500MB"
                      "limits_config":
                        "ingestion_rate_mb": 10
                        "max_chunks_per_query": 0
                        "max_entries_limit_per_query": 0
                        "max_query_length": "30d"
                        "max_query_parallelism": 6
                        "per_stream_rate_limit": "10MB"
                        "retention_period": "30d"
                      "querier":
                        "max_concurrent": 2
                        "query_timeout": "5m"
                      "query_range":
                        "cache_results": true
                        "max_retries": 50
                        "parallelise_shardable_queries": false
                        "results_cache":
                          "cache":
                            "memcached":
                              "expiration": "24h"
                            "memcached_client":
                              "service": "memcached-client"
                              "timeout": "500ms"
                      "ruler":
                        "alertmanager_url": "http://kube-prometheus-stack-alertmanager.kube-prometheus-stack:9093"
                      "server":
                        "grpc_server_max_recv_msg_size": 33554432
                        "grpc_server_max_send_msg_size": 33554432
                        "http_server_read_timeout": "180s"
                        "http_server_write_timeout": "180s"
                      "storage_config":
                        "boltdb_shipper":
                          "index_gateway_client":
                            "log_gateway_requests": true
                        "index_queries_cache_config":
                          "memcached":
                            "expiration": "24h"
                          "memcached_client":
                            "service": "memcached-client"
                            "timeout": "500ms"
                  "memcachedChunks":
                    "enabled": true
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "memcachedFrontend":
                    "enabled": true
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "memcachedIndexQueries":
                    "enabled": true
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "memcachedIndexWrites":
                    "enabled": true
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "querier":
                    "affinity": ""
                    "maxUnavailable": 2
                    "replicas": 4
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "queryScheduler":
                    "affinity": ""
                    "enabled": true
                    "resources":
                      "limits":
                        "memory": "512Mi"
                      "requests":
                        "cpu": "100m"
                        "memory": "256Mi"
                  "ruler":
                    "directories": {}
                    "enabled": false
                "promtail":
                  "config":
                    "clients":
                    - "url": "http://loki-distributor.loki-stack:3100/loki/api/v1/push"
                  "resources":
                    "limits":
                      "memory": "512Mi"
                    "requests":
                      "cpu": "100m"
                      "memory": "256Mi"
                  "tolerations":
                  - "effect": "NoSchedule"
                    "operator": "Exists"
            EOT,
          + (sensitive value),
        ]
      + output = (known after apply)
    }

  # module.loki-stack.module.loki-stack.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "loki-stack"
              + "cluster"     = "in-cluster"
            }
          + name             = "loki-stack"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "loki-stack"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/loki-microservice"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-loki-stack.git"
              + target_revision = "v8.1.0"

              + helm {
                  + release_name = "loki"
                  + values       = (known after apply)
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
        }
    }

  # module.loki-stack.module.loki-stack.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd"   = (known after apply)
          + "longhorn" = (known after apply)
        }
    }

  # module.loki-stack.module.loki-stack.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.thanos.module.thanos.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + append_list = false
      + id          = (known after apply)
      + input       = [
          + (sensitive value),
          + (sensitive value),
        ]
      + output      = (known after apply)
    }

  # module.thanos.module.thanos.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "thanos"
              + "cluster"     = "in-cluster"
            }
          + name             = "thanos"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "thanos"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/thanos"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-thanos.git"
              + target_revision = "v5.0.0"

              + helm {
                  + release_name = "thanos"
                  + values       = (known after apply)
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
        }
    }

  # module.thanos.module.thanos.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd"       = (known after apply)
          + "cert-manager" = (known after apply)
          + "longhorn"     = (known after apply)
          + "oidc"         = (known after apply)
          + "traefik"      = (known after apply)
        }
    }

  # module.thanos.module.thanos.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

  # module.thanos.module.thanos.random_password.oauth2_cookie_secret will be created
  + resource "random_password" "oauth2_cookie_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.thanos.module.thanos.random_password.redis_password will be created
  + resource "random_password" "redis_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.traefik.module.traefik.data.utils_deep_merge_yaml.values will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = [
          + <<-EOT
                "traefik":
                  "additionalArguments":
                  - "--serversTransport.insecureSkipVerify=true"
                  "deployment":
                    "replicas": 2
                  "logs":
                    "access":
                      "enabled": true
                  "metrics":
                    "prometheus":
                      "service":
                        "enabled": true
                      "serviceMonitor": {}
                  "ports":
                    "web":
                      "redirectTo":
                        "port": "websecure"
                  "resources":
                    "limits":
                      "memory": "256Mi"
                    "requests":
                      "cpu": "150m"
                      "memory": "128Mi"
                  "tlsOptions":
                    "default":
                      "minVersion": "VersionTLS12"
            EOT,
          + (known after apply),
        ]
      + output = (known after apply)
    }

  # module.traefik.module.traefik.argocd_application.this will be created
  + resource "argocd_application" "this" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "application" = "traefik"
              + "cluster"     = "in-cluster"
            }
          + name             = "traefik"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "llm-models-sks"
          + revision_history_limit = 10

          + destination {
              + name      = "in-cluster"
              + namespace = "traefik"
                # (1 unchanged attribute hidden)
            }

          + source {
              + path            = "charts/traefik"
              + repo_url        = "https://github.com/camptocamp/devops-stack-module-traefik.git"
              + target_revision = "v6.3.0"

              + helm {
                  + release_name = "traefik"
                  + values       = (known after apply)
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }

              + retry {
                  + limit = "5"

                  + backoff {
                      + duration     = "20s"
                      + factor       = "2"
                      + max_duration = "2m"
                    }
                }
            }
        }
    }

  # module.traefik.module.traefik.null_resource.dependencies will be created
  + resource "null_resource" "dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "argocd" = (known after apply)
        }
    }

  # module.traefik.module.traefik.null_resource.this will be created
  + resource "null_resource" "this" {
      + id = (known after apply)
    }

Plan: 77 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_issuers       = {
      + default    = "selfsigned-issuer"
      + production = "letsencrypt-prod"
      + staging    = "letsencrypt-staging"
    }
  + ingress_domain        = "llm-models-sks.is-sandbox-exo.camptocamp.com"
  + kubernetes_kubeconfig = (sensitive value)

Warning: AWS account ID not found for provider

  with provider["registry.terraform.io/hashicorp/aws"].exoscale-s3,
  on terraform.tf line 38, in provider "aws":
  38: provider "aws" {

See
https://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id
for implications.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @chornberger-c2c, Action: `pull_request`, Working Directory: ``, Workflow: `Automatic terraform plan on PR`*